import pandas as pd
import os

from check_understanding import creat_json

res = [('什么', 20.54205836955736), ('否么', 4.446093182824677), ('多么', 3.002905064215344), ('多少', 1.577176437620077),
       ('什吗', 1.5593217434588105), ('否吗', 0.8865126816371852), ('什少', 0.7812683594065443), ('癌么', 0.6182586527188495),
       ('什是', 0.5655959962573867), ('肿么', 0.5361363823315426), ('正么', 0.46141993585706215), ('否少', 0.44278565686573057),
       ('否是', 0.4344455287987299), ('否病', 0.41220045808339195), ('什病', 0.4075472393906508), ('多吗', 0.38265981165062873),
       ('病么', 0.36410638521343686), ('什瘤', 0.31406571791127313), ('不么', 0.2605636875204197), ('何么', 0.2562253668877388),
       ('甚么', 0.24097169244777644), ('什事', 0.2370805710690958), ('什癌', 0.23207975381854543), ('多是', 0.2160712996630325),
       ('否癌', 0.1682240816423227), ('否[UNK]', 0.14587018139729635), ('什点', 0.14034113287742933),
       ('癌瘤', 0.12239427137606987), ('什级', 0.10972783235599692), ('假么', 0.10634051565502212),
       ('肿瘤', 0.1059741655755044), ('否查', 0.10106890373997413), ]
prompt = '是[MASK][MASK]？'
for r in res:
    cur_prompt = prompt.replace("[MASK][MASK]", r[0])
    print(cur_prompt)
    dataframe = pd.read_csv('../data/understanding.csv')
    creat_json(dataframe, cur_prompt, '{quantity}' + cur_prompt)
    os.chdir("../../question_answering/")  # 修改当前工作目录
    os.system('./bert_evaluate.sh ' + cur_prompt)
    os.chdir("../quantity_extraction_and_understanding/get_prompt/")  # 修改当前工作目录
