import pandas as pd
import os

from check_understanding import creat_json

res = [('是不', 1.2325678313720358), ('，[UNK]', 1.0427404075944362), ('肿块', 1.040756363860576),
       ('复查', 0.9426236044949109), ('患者', 0.753197004025604), ('，不', 0.7221676589120141), ('门诊', 0.630101893158745),
       ('是度', 0.5409028012312769), ('是[UNK]', 0.5316810132865177), ('是否', 0.5297005826320468),
       ('直肠', 0.45767663338034836), ('##d##v', 0.457445166709296), ('病者', 0.453024831357701),
       ('是因', 0.4242354303314427), ('是的', 0.32384999474779796), ('前者', 0.3098828414223629), ('肿瘤', 0.2615116461291441),
       ('，否', 0.2453622107661852), ('##ci##v', 0.22414400773507348), ('是果', 0.22324454146587802),
       ('是温', 0.21951183606177516), ('##d1', 0.20238479584266617), ('是者', 0.15551864670717025),
       ('钟还', 0.1551042159340481), ('，者', 0.152251018513893), ('[UNK]，', 0.13983613830894023),
       ('##hg，', 0.13412726191170687), ('指因', 0.1299282289484249), ('原因', 0.12746329982518378),
       ('，还', 0.12640787807728873), ('是么', 0.12397470116030448), ('，度', 0.10500579626626177),
       ('：[UNK]', 0.10395375362551533), ]
prompt = '[MASK][MASK]是？'
for r in res:
    cur_prompt = prompt.replace("[MASK][MASK]", r[0])
    print(cur_prompt)
    dataframe = pd.read_csv('../data/understanding.csv')
    creat_json(dataframe, cur_prompt, '{quantity}' + cur_prompt)
    os.chdir("../../question_answering/")  # 修改当前工作目录
    os.system('./bert_evaluate.sh ' + cur_prompt)
    os.chdir("../quantity_extraction_and_understanding/get_prompt/")  # 修改当前工作目录
